## 20190126  宋明霖  组人员调整F5 李松健 <=> C3 范嵩  ==> C3 李松健, F5 范嵩，去掉I4
## 20190201  宋明霖  fdh=>lph
##                   相应的角色也调整
#注意：除了更改初始列表外，还需要更改每个人的计数器求和函数
#节假日 使用git测试 test2
#王欣男，从5月份开始不再参加夜班值班工作,备份现有的计数器、排班配置；修改配置，调整计数器 J1相关的配置去掉
#国务院五一休假调整，添加5.1、5.2，及节假日后第一天5.3=>5.6
#王欣(女）不再参加值班、李沛衡暂不参加值班，张驰、沈全从新员工转为老员工（可担任值班经理）
holiday = ["20180924", "20180929","20180930", "20181001", "20181002", "20181003", "20181004", "20181005", "20181006",
           "20181007", "20181229", "20181230", "20181231", "20190101",
           "20190202", "20190203", "20190204", "20190205", "20190206", "20190207", "20190208", "20190209", "20190210",
           "20190405", "20190406", "20190407",
           "20190501", "20190502", "20190503",
           "20190607", "20190608", "20190609","20190913",
           "20191001", "20191002", "20191003", "20191004", "20191005", "20191006", "20191007",
           "20191228", "20191229", "20191230", "20191231", "20200101"]
#节假日前一个交易日
holiday_lastday = ["20180921","20180928","20181228", "20190201", "20190404","20190430","20190606","20190912","20190930","20191227"]
#节假日后一个交易日
holiday_nextday = ["20180925","20181008","20190102", "20190211", "20190408","20190506", "20190610","20190916","20191008","20200102"]


#和宋老师对接的转化字典
SongDict =   { 'A1':'hw', 'A2':'dzt', 'A3':'srk', 'A4':'zyh', 'A5':'bk', 'A6':'sq', \
               'B1':'spc', 'B2':'wxl', 'B3':'yhr', 'B4':'wmy', 'B5':'yl', 'B6':'czh', 'H4':'yanglei', \
               'C1':'wyj', 'C2':'lph', 'C3':'lsj', 'C4':'zky', 'C5':'cj', 'C6':'lyc', 'C7':'fjk',  \
               'D1':'zn', 'D2':'zmm', 'D3':'xyj', 'D4':'wxlv', \
               'E1':'dxj', 'E2':'gxy', 'E3':'zxs', 'E4':'gzq', \
               'F1':'wel', 'F2':'lal', 'F3':'sml', 'F4':'czlv', 'F5':'fs',\
               'G1':'yqq', 'C8':'sxm', \
               'H1':'dlm', 'H2':'zc', 'H3':'zyf', \
               'I1':'wsg', 'I2':'ccm', 'I3':'ht' }#, 20190311 by songml#'I4':'yxl', \
               #'J1':'wx'} #20190311 by songml

SongDictNew = {'A1': 'hw', 'A2': 'srk', 'A3': 'zyh', 'A4': 'bk', 'A5': 'dzt', 'A6': 'sq', 'A7': 'yanglei', 'A8': 'none',
               'A9': 'none', 'A10': 'none', 'A11': 'none', 'A12': 'none', 'A13': 'none', 'A14': 'none', 'A15': 'none',
               'B1': 'spc', 'B2': 'yhr', 'B3': 'wmy', 'B4': 'czh', 'B5': 'wxl', 'B6': 'yl', 'B7': 'sml', 'B8': 'none',
               'B9': 'none', 'B10': 'none', 'B11': 'none', 'B12': 'none', 'B13': 'none', 'B14': 'none', 'B15': 'none',
               'C1': 'wyj', 'C2': 'zky', 'C3': 'cj', 'C4': 'lmj', 'C5': 'fjk', 'C6': 'lyc', 'C7': 'lsj', 'C8': 'sxm',
               'C9': 'none', 'C10': 'none', 'C11': 'none', 'C12': 'none', 'C13': 'none', 'C14': 'none', 'C15': 'none',
               'D1': 'zmm', 'D2': 'xyj', 'D3': 'zn', 'D4': 'czlv', 'D5': 'lal', 'D6': 'zyf', 'D7': 'zc', 'D8': 'fs',
               'D9': 'wxlv', 'D10': 'none', 'D11': 'none', 'D12': 'none', 'D13': 'none', 'D14': 'none', 'D15': 'none',
               'E1': 'dxj',  'E2': 'zxs', 'E3': 'gxy', 'E4': 'gzq', 'E5': 'wsg', 'E6': 'yqq', 'E7': 'ht', 'E8': 'ccm',
               'E9': 'none', 'E10': 'none', 'E11': 'none', 'E12': 'none', 'E13': 'none', 'E14': 'none', 'E15': 'none'}
               #, 20190619 by songml


##########################初始化员工列表#####################
# 主岗列表
list_main = ['A1', 'A5', 'B1', 'C1', 'D1', 'D3', 'E1', 'E5', 'E6']# 20190311, 'J1']
# 新人列表
list_new = ['A7', 'C5', 'C6', 'C7', 'D6', 'E7', 'E8']
# 女员工列表
list_women = ['C4', 'D4', 'D5', 'D8', 'E5', 'E7', 'E8']
# 关键岗位备岗
list_backup = []
# 各岗位可值夜班人员
list_group_A = ['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7']
list_group_B = ['B1', 'B2', 'B3', 'B4', 'B5', 'B6', 'B7']
list_group_C = ['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8']
list_group_D = ['D1', 'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'D8']
list_group_E = ['E1', 'E2', 'E3', 'E4', 'E5', 'E6', 'E7', 'E8']

list_moni = ['B7', 'D4', 'D5', 'D8']
list_oa = ['A6', 'A7', 'D6', 'D7']

######人员列表####顺序和计数器中的顺序硬应该保持一致，否则计数混乱###############
map = [
    'A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10', 'A11', 'A12', 'A13', 'A14', 'A15',
    'B1', 'B2', 'B3', 'B4', 'B5', 'B6', 'B7', 'B8', 'B9', 'B10', 'B11', 'B12', 'B13', 'B14', 'B15',
    'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10', 'C11', 'C12', 'C13', 'C14', 'C15',
    'D1', 'D2', 'D3', 'D4', 'D5', 'D6', 'D7', 'D8', 'D9', 'D10', 'D11', 'D12', 'D13', 'D14', 'D15',
    'E1', 'E2', 'E3', 'E4', 'E5', 'E6', 'E7', 'E8', 'E9', 'E10', 'E11', 'E12', 'E13', 'E14', 'E15'
       ]




